<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\Category;
use App\Models\Place;
use App\Models\Review;
use App\Models\User;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;

class DatabaseSeeder extends Seeder
{
    /**
     * В этом файле расположены данные, которые вносятся в таблицы в БД c каждым её обновлением.
     * @return void
     */
    public function run(): void
    {
        //Данные пользователей, которые вносятся в БД c каждым её обновлением.
        //Данные администратора сайта
        User::insert([
            'name' => 'Admin',
            'surname' => 'Admin',
            'patronymic' => 'Admin',
            'email' => 'admin@admin.com',
            'phone' => '88001111111',
            'login' => 'admin',
            'password' => Hash::make('admin11'),
            'isAdmin' => 1,
            'created_at' => '2024-01-10 12:21:00',
            'updated_at' => '2024-01-10 12:21:00',
            ]);

        //Данные обычных пользователей
        User::insert([
            'name' => 'Иван',
            'surname' => 'Иванов',
            'patronymic' => 'Иванович',
            'avatar' => 'avatars/4dpzMoig03NLGhddKDdYB5nJgrtny46COxqZHcIx.jpg',
            'email' => 'ivan@ivan.com',
            'phone' => '88002222222',
            'login' => 'user1',
            'password' => Hash::make('1111111'),
            'isAdmin' => 0,
            'created_at' => '2024-01-12 21:45:00',
            'updated_at' => '2024-01-12 21:45:00',
        ]);

        User::insert([
            'name' => 'Дмитрий',
            'surname' => 'Маслов',
            'patronymic' => 'Алексеевич',
            'avatar' => 'avatars/OCzSIuiBqfX5MhZGTEoRb5aI7sZ8lLIKHCzjP8Sd.jpg',
            'email' => 'dimamaslov2005@vk.com',
            'phone' => '89026083085',
            'login' => 'dmaslov',
            'password' => Hash::make('dmaslov55'),
            'isAdmin' => 0,
            'created_at' => '2024-02-13 13:21:00',
            'updated_at' => '2024-02-13 13:21:00',
        ]);

        User::insert([
            'name' => 'Артур',
            'surname' => 'Стюрин',
            'patronymic' => 'Артемович',
            'email' => 'artur@vk.com',
            'phone' => '89024142424',
            'login' => 'arturS',
            'password' => Hash::make('arturS144'),
            'isAdmin' => 0,
            'created_at' => '2024-03-24 19:51:00',
            'updated_at' => '2024-03-24 19:51:00',
        ]);

        //Категории, которые вносятся в БД с каждым её обновлением.
        Category::insert([
           'name' => 'Музеи',
            'created_at' => '2024-01-09 16:14:50',
            'updated_at' => '2024-01-09 16:14:50',
        ]);

        Category::insert([
            'name' => 'Памятники',
            'created_at' => '2024-01-09 16:16:50',
            'updated_at' => '2024-01-09 16:16:50',
        ]);

        Category::insert([
            'name' => 'Исторические места',
            'created_at' => '2024-01-09 16:18:50',
            'updated_at' => '2024-01-09 16:18:50',
        ]);

        Category::insert([
            'name' => 'Парки и скверы',
            'created_at' => '2024-01-09 16:22:50',
            'updated_at' => '2024-01-09 16:22:50',
        ]);

        Category::insert([
            'name' => 'Зоопарки',
            'created_at' => '2024-01-09 16:24:50',
            'updated_at' => '2024-01-09 16:24:50',
        ]);

        Category::insert([
            'name' => 'Театры',
            'created_at' => '2024-01-09 16:26:50',
            'updated_at' => '2024-01-09 16:26:50',
        ]);

        Category::insert([
            'name' => 'Арены и стадионы',
            'created_at' => '2024-01-09 16:28:50',
            'updated_at' => '2024-01-09 16:28:50',
        ]);



        //Данные тур. мест, которые вносятся в БД с каждым её обновлением.
        Place::insert([
           'name' => 'Кировка - Челябинский Арбат',
           'short_description' => 'Самая красивая и интересная улица Челябинска',
           'description' => 'Кировка, или Челябинский Арбат, – пешеходная улица в центре Челябинска, которая получила свое «второе название» от уже ставше го нарицательным названия московского Арбата. Это самая знаменитая улица Челябинска, с которой, собственно, начался город. В 2000 году мэр Челябинска В. Тарасов принял решение сделать часть улицы пешеходной зоной и превратить ее в культурный памятник.',
           'image' => 'places/1VblEz4VlNsWgmWF2i87nuQ3vRFEOu2DFZBXCFgL.png',
           'address' => 'Челябинск, ул. Кирова',
           'category_id' => 3,
           'created_at' => '2024-01-10 12:21:00',
           'updated_at' => '2024-01-10 12:21:00',
        ]);

        Place::insert([
            'name' => "Ледовая арена \"Трактор\"",
            'short_description' => 'Здесь проводятся соревнования по хоккею и фигурному катанию',
            'description' => 'Ледовая арена «Трактор» в Челябинске — трёхэтажное сооружение, которое благодаря современному оборудованию и гибкой планировке легко трансформируется и позволяет проводить мероприятия любого формата. Здесь регулярно проходят хоккейные матчи, соревнования по баскетболу, волейболу, теннису, боксу, борьбе. Также на арене можно проводить концерты, выставки, фестивали и даже небольшие корпоративы.',
            'image' => 'places/c13dMiajEGdeDbCDs6FOkdnnhXUc5qchv0XEaPHZ.png',
            'address' => 'Челябинск, ул. 250-летия Челябинска, 38',
            'category_id' => 3,
            'created_at' => '2024-01-12 13:41:00',
            'updated_at' => '2024-01-12 13:41:00',
        ]);

        Place::insert([
            'name' => 'Памятник Курчатову',
            'short_description' => 'Монумент знаменитому физику-ядерщику Игорю Васильевичу Курчатову',
            'description' => 'Памятник Курчатову в Челябинске — это монумент знаменитому физику-ядерщику Игорю Васильевичу Курчатову, открытый в 1986 году к 250-летию Челябинска на площади Науки около здания Южно-Уральского государственного университета. Композиция представляет собой сложную архитектурно-скульптурную композицию, в состав которой входят два пилона и находящаяся между ними статуя Курчатова на постаменте. Полусферы на пилонах символизируют расщеплённый атом. Высота пилонов составляет 27 метров, высота статуи — 6,4 метра. Общая высота памятника (вместе с постаментом) — 11 метров. С 2014 года памятник включён в единый реестр объектов культурного наследия Российской Федерации.',
            'image' => 'places/MAwLfP9uYQBBI70TJT1DzMvhzY5jBRJR5qlm462p.png',
            'address' => 'Челябинск, площадь Науки',
            'category_id' => 2,
            'created_at' => '2024-03-05 17:13:00',
            'updated_at' => '2024-03-05 17:13:00',
        ]);

        Place::insert([
            'name' => 'Государственный исторический музей Южного Урала',
            'short_description' => 'Музей истории Челябинской области',
            'description' => 'Государственный исторический музей Южного Урала — музей истории Челябинской области, открытый в 1923 году. До 2016 года считался Челябинским государственным краеведческим музеем. В нём выставлен крупнейший из найденных осколков Челябинского метеорита. В 2016 году музей был переименован в Государственный исторический музей Южного Урала, чтобы привлечь специалистов из других городов и стран и получить дополнительное спонсорство.',
            'image' => 'places/hd4ITOU4VkqkPI836mYNWicWqJelDlv13YcNyVat.png',
            'address' => 'Челябинск, ул. Труда, 100',
            'category_id' => 1,
            'created_at' => '2024-12-24 12:23:18',
            'updated_at' => '2024-12-24 12:23:18',
        ]);

        Place::insert([
            'name' => 'Музей трудовой и боевой славы',
            'short_description' => 'Музей трудовой и боевой славы Челябинского тракторного завода (ЧТЗ)',
            'description' => 'Музей трудовой и боевой славы Челябинского тракторного завода (ЧТЗ) открыт в октябре 1967 года. Это один из крупнейших музеев предприятий в Челябинской области. В музее шесть тематических залов, каждый из которых охватывает какой-либо временной период в истории создания и развития ЧТЗ. В каждом зале собраны уникальные фотографии, документы, личные вещи и предметы участников тех событий, сотрудников завода. 2 В музее можно увидеть макеты легендарных танков ИС-3, КВ-1, Т-34 и многих других боевых машин. Регулярно проводятся экскурсии, встречи молодёжи с ветеранами войны, ветеранами Танкограда, ведущими специалистами завода, знатными тракторостроителями.',
            'image' => 'places/c1Vd4O5LxH5Pq7wRsNdpffRZN1OIhiocYCNqOfUs.png',
            'address' => 'Челябинск, пр. Ленина, 19',
            'category_id' => 1,
            'created_at' => '2024-12-24 12:34:55',
            'updated_at' => '2024-12-24 12:34:55',
        ]);

        Place::insert([
            'name' => 'Музей Почтовой Связи',
            'short_description' => 'Единственный на Южном Урале музей почтовой отрасли',
            'description' => 'Музей почтовой связи в Челябинске — единственный на Южном Урале музей почтовой отрасли, открытый 16 марта 2007 года. Экспозиция включает более 8000 экспонатов, включая почтовую карту Российской империи 1852 года, карту первых маршрутов Челябинской почты, панораму «Почтовая станция. XIX век», металлические сундуки 1898 и 1912 годов, дореволюционные открытки, фронтовые письма, коллекцию почтовых марок 1923–1929 годов. В большом зале представлены почтовая техника, атрибутика, госзнаки почтовой оплаты, форменная одежда и рабочее место почтальона, почтовые ящики, посылки, почтовые издания, именные вещи и весовое хозяйство. Зал «Быт почтовика» знакомит с интерьером советских времён, а зал «Фронт и тыл. Почтальоны — связные войны» — с макетом военной землянки, солдатской формой времён Великой Отечественной войны, фронтовыми средствами связи, почтовым ящиком военно-полевой почты и письмами-треугольниками.',
            'image' => 'places/AiyvN7RAKNafMi88vsy6XVrAqRuri1vqvftqvUf9.png',
            'address' => 'Челябинск, пр. Ленина, 64',
            'category_id' => 1,
            'created_at' => '2024-12-24 12:43:45',
            'updated_at' => '2024-12-24 12:43:45',
        ]);

        Place::insert([
            'name' => 'Дом-особняк купца Рябинина',
            'short_description' => 'Памятник архитектуры регионального значения',
            'description' => 'Дом-особняк Рябинина в Челябинске — памятник архитектуры регионального значения, расположенный на улице Каслинская, 137. Этот дом начала XX века привлекает внимание своим уникальным обликом. Особенности дома: Кирпичный цоколь с облицовкой из белого камня; Деревянный верхний этаж; Асимметричный главный фасад с тремя декоративными башенками; Резные наличники и узорчатый карниз; Анфилада комнат вдоль; Терраса и застеклённая веранда в северо-восточном углу; Сени с парадным входом с севера; Дом-особняк Рябинина сохраняет облик домов прошлого столетия, позволяя погрузиться в быт и культуру того времени. Посещение этого дома — возможность насладиться красотой архитектуры и узнать больше об истории Челябинска.',
            'image' => 'places/zWYxoQOezP5RlWIw6AIUNlFEW0HCxe5XSqkCoPhL.png',
            'address' => 'Челябинск, ул. Каслинская, 137',
            'category_id' => 3,
            'created_at' => '2024-12-24 13:12:25',
            'updated_at' => '2024-12-24 13:12:25',
        ]);

        Place::insert([
            'name' => 'Александро-Невская церковь',
            'short_description' => 'Православный храм, освящённый в память князя Александра Невского',
            'description' => 'Александро-Невская церковь в Челябинске — одна из главных архитектурных и культурных достопримечательностей города, яркая, с изящными куполами, расположена в историческом центре. Церковь была заложена 22 июня 1907 года на месте недостроенной Александровской часовни в память об убитом императоре Александре II, строительство велось на пожертвования горожан, городской думы и царя Николая II и завершилось к 1911 году. Церковь одноэтажная, с подвалом, 13-главая из красного кирпича, к западу примыкает трапезная. Декор в неорусском стиле, колокольня трёхъярусная, шатровая. Внутри росписи на сюжеты канонизированных русских святых. До 2013 года в храме размещался Зал органной музыки с лучшим органом в Европе — инструментом немецкой фирмы «Германн Ойле». В 2010 году здание возвращено епархии, сегодня здесь проходят церемонии и богослужения.',
            'image' => 'places/liUOH2QVh0YQ1sdz5OZqNgbJFDbtgpfq8Dkjzc6W.png',
            'address' => 'Челябинск, Свердловский просп., 59А',
            'category_id' => 3,
            'created_at' => '2024-12-24 13:18:35',
            'updated_at' => '2024-12-24 13:18:35',
        ]);

        Place::insert([
            'name' => 'Водонапорная башня',
            'short_description' => 'Водонапорная башня городского водопровода',
            'description' => 'Водонапорная башня городского водопровода в Челябинске — это достопримечательность, построенная в 1911 году. Она расположена на самой высокой точке города — 245 метров над уровнем моря. Башня построена в стиле модерн. У неё высокий гранитный цоколь с крыльцом, украшенным узорами кованого железа, два кирпичных этажа, разделённых зигзагами карниза, третий этаж — деревянный. Все восемь граней башни имеют окна, остеклённые окна чередуются с ложными. Фасад башни украшен эркерами. Внутри башни находился железный резервуар ёмкостью 15 тысяч вёдер воды. Высота резервуара (его дна) от земли превышала 12 метров, что обеспечивало напор воды по всему городу. С 1978 года башня считается памятником истории и культуры регионального значения.',
            'image' => 'places/SzzPjGCsfLhbMDY1JH4yZGc0ZwarPjb59ms2b4q2.png',
            'address' => 'Челябинск, ул. Воровского, 11',
            'category_id' => 3,
            'created_at' => '2024-12-24 13:28:58',
            'updated_at' => '2024-12-24 13:28:58',
        ]);

        Place::insert([
            'name' => 'Парк им.Гагарина',
            'short_description' => 'Место для отдыха с лесной атмосферой',
            'description' => 'Центральный парк культуры и отдыха им. Ю.А. Гагарина в Челябинске — муниципальное учреждение культуры, особо охраняемая природная территория местного значения, памятник ландшафтной архитектуры. Площадь парка — 1200 гектаров, меньше трети территории занимают аттракционы, детские площадки, фонтаны. Остальное — хвойный лес. Зона отдыха включает пешеходные аллеи с цветниками и клумбами, малую Южно-Уральскую железную дорогу, спортивные, игровые, танцевальные площадки, летний театр, аттракционы, детский городок, кафе. Заброшенные карьеры представляют собой живописные водоёмы. Парк примыкает к реликтовому сосновому бору площадью 1200 гектаров, где обитают зайцы, белки и летучие мыши. На территории парка проводятся различные культурно-развлекательные мероприятия — музыкальные концерты, танцевальные фестивали, семейные и спортивные праздники, ярмарки-выставки, благотворительные программы.',
            'image' => 'places/BzJKZAAh87Fu9awcy1truMrePdlbh8PZtVz3943X.png',
            'address' => 'Челябинск, ул. Коммуны, 100, стр. 6',
            'category_id' => 4,
            'created_at' => '2024-12-24 13:39:04',
            'updated_at' => '2024-12-24 13:39:04',
        ]);

        Place::insert([
            'name' => 'Парк Алое поле',
            'short_description' => 'Парк отдыха, расположенный в историческом центре города',
            'description' => '«Алое поле» в Челябинске — парк отдыха в историческом центре города, любимое место встреч горожан, прогулочная зона и историческая территория, хранящая память о ярмарках и традициях Челябинска конца XIX — начала XX веков. Парк представляет собой прямоугольную зелёную зону, ограниченную улицей Труда, Свердловским проспектом, проспектом Ленина и Красной улицей. В центре парка находится Храм Александра Невского, от которого лучами расходятся мощёные дорожки. В южной части стоят памятники Ленину и пионерам-героям, на углу проспекта Ленина и Красной улицы — памятник Орлёнку. В северной части — Дворец пионеров и школьников им. Н.К. Крупской. Парк удобен для прогулок и массовых мероприятий. На специально выделенных площадках проходят праздники, турниры и соревнования.',
            'image' => 'places/X4roBPDtThCsMSRBKkEGRtxbIoCt6Uz7Vzm1sbZS.png',
            'address' => 'Челябинск, Алое поле',
            'category_id' => 4,
            'created_at' => '2024-12-24 13:46:13',
            'updated_at' => '2024-12-24 13:46:13',
        ]);

        Place::insert([
            'name' => 'Театр кукол им. Вольховского',
            'short_description' => 'Театр, радующий кукольными постановками весь Урал',
            'description' => 'Челябинский государственный областной театр кукол имени В. Вольховского — один из старейших в России и на Урале. Образован драматическими актёрами Павлом и Ниной Гаряновыми, приехавшими в Челябинск в начале 1930-х годов. Театр активно гастролирует по России, является лауреатом и участником многочисленных зарубежных и российских фестивалей, лауреатом Национальной театральной премии «Золотая маска», лауреатом Премии правительства РФ имени Фёдора Волкова за значительный вклад в развитие театрального искусства России.',
            'image' => 'places/gRRIOCwD9FxAx1dMHUKkURPGn4hI4e1qk4M8k7go.png',
            'address' => 'Челябинск, Челябинск, ул. Кирова, 8',
            'category_id' => 6,
            'created_at' => '2024-12-24 13:56:23',
            'updated_at' => '2024-12-24 13:56:23',
        ]);

        Place::insert([
            'name' => 'Драматический камерный театр',
            'short_description' => 'Уютный театр с комфортной сценой',
            'description' => 'Челябинский государственный драматический «Камерный театр» — небольший, но уютный театр с комфортной сценой, которую хорошо видно и слышно с любого места. В фойе играет живая музыка, а на стенах висят красивые картины. В буфете можно купить бутерброды с икрой, лососем или колбасой, а также круассаны и кофе. Театр основан в 1988 году актёрами челябинского ТЮЗа Евгением Фалевичем и Людмилой Барад. Первоначально у театра не было своего здания, приходилось арендовать случайные помещения и даже подвалы. 20 мая 1989 года состоялась премьера первого спектакля — «Крика лангусты» по пьесе Д. Марелла.',
            'image' => 'places/jeDtAaT1UvlrjQtg65dpFXINcO4vhh0V5zgwOAZG.png',
            'address' => 'Челябинск, ул. Цвиллинга, 15',
            'category_id' => 6,
            'created_at' => '2024-12-24 14:06:08',
            'updated_at' => '2024-12-24 14:06:08',
        ]);

        Place::insert([
            'name' => 'Челябинский Зоопарк',
            'short_description' => 'Зоологический парк в центральном районе города',
            'description' => 'Челябинский зоопарк — зоологический парк в центральном районе Челябинска. Был открыт в 1996 году. Занимает территорию в 30 гектаров, на которой содержится более 110 видов животных. В основе экспозиции — представители животного мира трёх природных зон Челябинской области: горностепной (обитатели горной тайги, смешанных и широколиственных лесов), степной и лесостепной (животные степей и долин рек). Также представлены десятки видов экзотических животных из разных уголков мира. На территории зоопарка работают детский контактный зоопарк, аквариум с водными обитателями из разных частей света, инсектарий с тропическими насекомыми и беспозвоночными животными.',
            'image' => 'places/F3AZOxCQNvOygJq317nLplzPbu0PymXRkY2W2WVZ.png',
            'address' => 'Челябинск, ул. Труда, 191',
            'category_id' => 5,
            'created_at' => '2024-12-24 14:11:37',
            'updated_at' => '2024-12-24 14:11:37',
        ]);

        Place::insert([
            'name' => 'Центральный Стадион',
            'short_description' => 'Домашний футбольный стадион в Челябинске',
            'description' => '«Центральный» (ранее — «Труд») — футбольный стадион в Челябинске. Домашний стадион футбольного клуба «Челябинск», выступающего во втором дивизионе Чемпионата России по футболу, и любительского футбольного клуба «Академия футбола», выступающего в первенстве Челябинской области. Стадион был построен в 1935 году как многофункциональный спорткомплекс, рассчитанный на проведение соревнований по боксу, борьбе и лёгкой атлетике. В 1953 году «Труд» был перепрофилирован в футбольный стадион. В 2023 году была начата реконструкция стадиона, которая включала в себя замену кресел, укрепление фундамента, замену искусственного газона, ремонт северной трибуны, добавление тёплых подтрибунных помещений для болельщиков. В 2024 году была произведена замена искусственного газона на новый, привезённый из Франции.',
            'image' => 'places/K9q72koHSuRsLjM5dKqNeZGwRnNk7mEZpBfTnZZT.png',
            'address' => 'Челябинск, ул. Коммуны, 98',
            'category_id' => 7,
            'created_at' => '2024-12-24 14:15:57',
            'updated_at' => '2024-12-24 14:15:57',
        ]);

        Place::insert([
            'name' => 'Сквер им. С. С. Андреевского',
            'short_description' => 'Сквер в Центральном районе с фонтаном',
            'description' => 'Сквер находится на пересечении улиц Воровского, Энгельса и Худякова. Есть фонтан, который освежает в жару, так же там удобно гулять с ребенком, который может прокататься на велосипеде или роликах по дорожкам сквера. Назван в честь штаб-лекаря Степана Семёновича Андреевского, исследовавшего «сибирскую язву» в Челябинской округе. В конце XVIII века он прибыл из Санкт-Петербурга, чтобы выяснить причину смерти местных крестьян и скота. Вскрыл сотни тел и заразил себя, став первым доктором, привившим себе смертельно опасное заболевание. Летом в сквере работает оригинальный фонтан: земной шар, который держат три кита.',
            'image' => 'places/w5nM1usOuPsO3ZiGZ2QjeWNKxzoZevRTu0yRyvWZ.jpg',
            'address' => 'Челябинск, ул. Энгельса, 107',
            'category_id' => 4,
            'created_at' => '2024-12-25 14:45:13',
            'updated_at' => '2024-12-25 14:45:13',
        ]);

        //Отзывы о тур. местах, которые вносятся в БД с каждым её обновлением.
        //Кировка - Челябинский Арбат
        Review::insert([
            'user_id' => 2,
            'place_id' => 1,
            'text' => 'Челябинский Арбат оказался очень приятным местом для прогулок. Если есть время, лучше прогуляться неспеша, разглядывая многочисленные памятники и скульптуры. На улице много больших и маленьких кафе, так что голодными не останетесь!',
            'rating' => 5,
            'created_at' => '2024-09-21 15:36:00',
            'updated_at' => '2024-09-21 15:36:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 1,
            'text' => 'Прогулки по Кировке это кайф! Почти как в Европе :) много всяких скульптур,памятников, фонтанов,лавочки,есть где покушать по пути.',
            'rating' => 5,
            'created_at' => '2024-10-01 13:44:00',
            'updated_at' => '2024-10-01 13:44:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 1,
            'text' => 'Центр Челябинска- настоящая помойка. Летом наблюдали торнадо из мусора), зимой-кучи грязного снега, небольшие парковки не чищены, брустверы полметра, но суровые челябинские водители могут на них забраться. И вообще город очень не ухожен, полное ощушение запущенности. За несколько лет поездок не встретилось ни одного приличного ресторана или кафе, сервис не важный.',
            'rating' => 2,
            'created_at' => '2024-10-04 15:24:00',
            'updated_at' => '2024-10-04 15:24:00',
        ]);

        //Ледовая арена "Трактор"
        Review::insert([
            'user_id' => 2,
            'place_id' => 2,
            'text' => 'Очень классное место. Много ярких моментов было в этом месте. Персонал отличный, всегда поможет если это необходимо.',
            'rating' => 5,
            'created_at' => '2024-08-30 14:35:00',
            'updated_at' => '2024-08-30 14:35:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 2,
            'text' => 'Какое же неуважение к своим болельщикам. Посмотрите как народ метается, присмаьривая место для парковки. Весь перекрёсток Юлаева и 250 лет забит машинами. Все прилегающие дворы в машинах и это называется организация мероприятий? Организаторы откройте глаза и промониторьте этот вопрос. Развязки хорошей для общественного транспорта около арены нет, так и на машине не приехать. Если мероприятие назначено на 7, народ начинает уже приезжать в 5, чтоб нормально припарковаться. А сколько машин во дворах перебитых из за того,что как в бочку набьются а потом в вечернее время да в суматохе разьехаться не могут.',
            'rating' => 2,
            'created_at' => '2024-09-01 15:33:00',
            'updated_at' => '2024-09-01 15:33:00',
        ]);

        //Памятник Курчатову
        Review::insert([
           'user_id' => 2,
            'place_id' => 3,
            'text' => 'Памятник И. В. Курчатову впечатляет своим величием и архитектурной проработкой. Место ухоженное, с чистыми дорожками и зелеными насаждениями. Информационные таблички рассказывают о жизни и достижениях ученого, что делает посещение еще более познавательным. Отличное место для тех, кто хочет отдать дань уважения великому ученому и насладиться спокойной атмосферой.',
            'rating' => 5,
            'created_at' => '2024-12-18 14:12:00',
            'updated_at' => '2024-12-18 14:12:00',
        ]);

        Review::insert([
           'user_id' => 3,
            'place_id' => 3,
            'text' => 'Очень красивый монумент в городе. Большая площадь и рядом маленький ТРЦ. Но во время посещении заметил много мусора и окурок рядом со скамеек. Просто некоторые некультурные люди сорят где попало. А так в целом хорошо.',
            'rating' => 4,
            'created_at' => '2024-09-20 12:34:00',
            'updated_at' => '2024-09-20 12:34:00',
        ]);

        Review::insert([
           'user_id' => 4,
            'place_id' => 3,
            'text' => 'На данный момент, по моему мнению, требуется реставрация памятника и территории рядом с ним.',
            'rating' => 1,
            'created_at' => '2024-09-13 15:36:00',
            'updated_at' => '2024-09-13 15:36:00',
        ]);

        //Государственный исторический музей Южного Урала
        Review::insert([
            'user_id' => 2,
            'place_id' => 4,
            'text' => 'Челябинский краеведческий музей - это просто уникальное место! Нашей главной целью было посмотреть Челябинский метеорит. Но больше всего мы были поражены многообразием экспонатов флоры и фауны Южного Урала. Очень понравились постоянные экспозиции, представляющими быт народов Урала и предметов 20 века. Остались очень довольны!',
            'rating' => 5,
            'created_at' => '2024-08-11 16:37:00',
            'updated_at' => '2024-08-11 16:37:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 4,
            'text' => 'Хороший музей истории Челябинска и области. Много экспонатов и информации.  Стоимость билета за посещение всех секций музея 500 рублей.',
            'rating' => 4,
            'created_at' => '2024-08-11 16:37:00',
            'updated_at' => '2024-08-11 16:37:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 4,
            'text' => 'Очень информативные экспозиции, приятные и вежливые работники и экскурсоводы. Цены приемлемые, есть официальный сайт для большего ознакомления. Время пролетает незаметно, остаётся масса впечатлений! Очень советую посетить музей с друзьями, детьми, любимыми! ',
            'rating' => 5,
            'created_at' => '2024-08-11 18:11:00',
            'updated_at' => '2024-08-11 18:11:00',
        ]);

        //Музей трудовой и боевой славы
        Review::insert([
            'user_id' => 2,
            'place_id' => 5,
            'text' => 'Первый раз в Челябинске, хорошо, что посетил этот музей. Очень содержательная экскурсия. Спасибо Надежде Арсеньевне!',
            'rating' => 5,
            'created_at' => '2024-08-12 19:13:00',
            'updated_at' => '2024-08-12 19:13:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 5,
            'text' => 'Побывал в музее с коллегами и все остались в восторге!!! Директор музея, экскурсовод с большой буква - Надежда Артемьевна Дида провела экскурсию с такой любовью к городу, заводу, музею, что невозможно остаться равнодушным к экскурсии. Насколько я интересуюсь историей города, но тут я узнала столько нового для себя. Очень душевно, информативно и патриотично!',
            'rating' => 5,
            'created_at' => '2024-08-12 19:13:00',
            'updated_at' => '2024-08-12 19:13:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 5,
            'text' => 'Были семьёй в турпоездке в г. Челябинск. В плане посещений был данный музей. Огромная Благодарность Надежде Артемьевне за потрясающую, наполненную, трогательную экскурсию!Остались под огромными впечатлениями.Рекомендуем музей к обязательному посещению как гостям так и жителям города.',
            'rating' => 5,
            'created_at' => '2024-07-29 21:34:00',
            'updated_at' => '2024-07-29 21:34:00',
        ]);

        //Музей Почтовой Связи
        Review::insert([
            'user_id' => 2,
            'place_id' => 6,
            'text' => 'История почты от и до. Очень интересные инсталляции. Можно попробовать и пописать пером и чернилами. Ходить лучше с экскурсией.',
            'rating' => 4,
            'created_at' => '2024-08-11 11:12:00',
            'updated_at' => '2024-08-11 11:12:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 6,
            'text' => 'Музей открыт для свободного посещения только по средам. В остальные дни только в составе групп по предварительной заявке.информация об этом есть только на двери музея.',
            'rating' => 1,
            'created_at' => '2024-09-12 13:14:00',
            'updated_at' => '2024-09-12 13:14:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 6,
            'text' => 'Был создан еще в 2007 году. Вообще как нам рассказали в музеи, это один музей почтовой связи на всем южном Урале. В музее три зала, самое познавательное и интересное, что мне особо понравилось, что есть интерактивные площадки, например, поставить штемпель или машинопись. Детям очень познавательно и любопытно, рекомендую.',
            'rating' => 5,
            'created_at' => '2024-08-10 15:16:00',
            'updated_at' => '2024-08-10 15:16:00',
        ]);

        //Музей Почтовой Связи
        Review::insert([
            'user_id' => 3,
            'place_id' => 7,
            'text' => 'Был в командировке, и уставший гулял по вечернему Челябинску и вдруг остолбенел, увидев это чудо. Обошёл со всех сторон. Невероятное здание! Жаль, что таких строений не так много осталось.',
            'rating' => 5,
            'created_at' => '2024-09-12 18:11:00',
            'updated_at' => '2024-09-12 18:11:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 7,
            'text' => 'Как же мало осталось таких знаний, не только в городе, но и в целом по стране и это безусловно огромный плюс и хвала органам управления Челябинска, что поддерживают памятники в таком состоянии!!!',
            'rating' => 5,
            'created_at' => '2024-09-13 19:16:00',
            'updated_at' => '2024-09-13 19:16:00',
        ]);

        //Александро-Невская церковь
        Review::insert([
            'user_id' => 2,
            'place_id' => 8,
            'text' => 'Большой и старый храм с хорошо гармонирующими на фоне парка зелеными классическими и шатровыми куполами. Но требует косметического ремонта - краса осыпается, двери страшные. Храм украшен резным кирпичом, но, на мой взгляд, покраска наличиников и кокошников пошла бы ему к лицу.',
            'rating' => 4,
            'created_at' => '2024-09-13 19:16:00',
            'updated_at' => '2024-09-13 19:16:00',
        ]);

        //Водонапорная башня
        Review::insert([
            'user_id' => 2,
            'place_id' => 9,
            'text' => 'Уникальное место в центре города, остатки старой архитектуры на фоне новой элитной застройки, что довольно типично для Челябинска.',
            'rating' => 4,
            'created_at' => '2024-09-13 19:16:00',
            'updated_at' => '2024-09-13 19:16:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 9,
            'text' => 'Такое необычное строение в любом европейском городе было бы ухоженным и востребованным - для выставки, небольшого музея, для кафе или бара. Здание с яркой индивидуальностью, да в самом центре города! Желаю башне лучшей судьбы - чтобы обратили на нее внимание реставраторы и рестораторы ))',
            'rating' => 5,
            'created_at' => '2024-08-19 11:11:30',
            'updated_at' => '2024-08-19 11:11:30',
        ]);

        //Парк им.Гагарина
        Review::insert([
            'user_id' => 2,
            'place_id' => 10,
            'text' => 'Простой и обычный парк для прогулок. Часть огорожена и закрыта на реконструкцию, после открытия наверное будет больше пространства.',
            'rating' => 5,
            'created_at' => '2024-08-25 12:31:10',
            'updated_at' => '2024-08-25 12:31:10',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 10,
            'text' => 'Не выполняют правила собственных аттракционов. Не пускают ребенка в сопровождении взрослого. Причем предыдущие разы пускали, а сейчас решили, что ребенок по возрасту не подходит. Отдых испорчен, ребенок зная как работают карусели, так как на них катался, очень расстроился.',
            'rating' => 2,
            'created_at' => '2024-09-26 13:41:10',
            'updated_at' => '2024-09-26 13:41:10',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 10,
            'text' => 'Прекрасный парк!!! Очень много маленьких озёр и умиротворяющая атмосфера! Находится в самом центре города. Замечательное место, рекомендую к посещению хоть с любимым человеком, хоть с семьей, хоть с друзьями 👍',
            'rating' => 5,
            'created_at' => '2024-09-01 12:34:15',
            'updated_at' => '2024-09-01 12:34:15',
        ]);

        //Парк Алое поле
        Review::insert([
            'user_id' => 2,
            'place_id' => 11,
            'text' => 'Достаточно обширный парк. В нем есть интересные активности и для детей, и для взрослых. Особенно меня умилили фигурки непонятных зверей 😁 Советую обязательно посетить его вечером, чтобы посмотреть на классную иллюминацию👍',
            'rating' => 5,
            'created_at' => '2024-10-01 13:13:00',
            'updated_at' => '2024-10-01 13:13:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 11,
            'text' => 'Парк Алое поле - небольшой сквер, в котором расположено несколько зданий, включая бывший Органный зал, архитектура которого впечатляет и заслуживает особого внимания. В самом парке очень много деревьев и не так много людей, что позволит спокойно отдохнуть в центральной части города от суеты и сделать красивые фотографии на фоне природы. Рядом находятся всевозможные магазины и рестораны, транспортные остановки в шаговой доступности. Не так далеко расположено и колесо обозрения до которого можно дойти в ходе прогулки.',
            'rating' => 4,
            'created_at' => '2024-10-06 14:56:59',
            'updated_at' => '2024-10-06 14:56:59',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 11,
            'text' => 'Зеленый островок в самом центре Челябинска, которым можно было бы гордиться, но состояние ужасное!Прекрасная Александро-Невская церковь в плачевном состоянии.Обшарпанные стены, кровля,деревянные двери и окна.Памятники пионерам фактически разрушены.Уборкой на территории фактически никто не занимается.Стыдно за город и Администрацию центрального р-она г.Челябинска,которая располагается в 50 метрах от парка.Похоже все они вахтовики в этом городе',
            'rating' => 2,
            'created_at' => '2024-10-10 12:34:15',
            'updated_at' => '2024-10-10 12:34:15',
        ]);

        //Театр кукол им. Вольховского
        Review::insert([
            'user_id' => 3,
            'place_id' => 12,
            'text' => 'В Челябинске есть замечательный театр кукол! Здесь всегда прекрасное настроение и детский смех!😉😊😀 Мы любим сюда приходить всей семьёй. Заряд положительной энергией обеспечен для всей семьи.😉 Великолепный состав актеров,которые потрясающе справляются с любыми ситуациями. А новогодние спектакли просто маленькое чудо!😊 Не буду рассказывать все секретики 😉. Приходите и смотрите сами! Рекомендую!',
            'rating' => 5,
            'created_at' => '2024-09-09 13:13:00',
            'updated_at' => '2024-09-09 13:13:00',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 12,
            'text' => 'Маленькие дети мои с удовольствием ходят в кукольный театр, особенно кода приезжают артисты. Очень здорово что есть такой в городе театр для маленьких детей!',
            'rating' => 5,
            'created_at' => '2024-10-13 14:15:00',
            'updated_at' => '2024-10-13 14:15:00',
        ]);

        //Драматический камерный театр
        Review::insert([
            'user_id' => 2,
            'place_id' => 13,
            'text' => 'Небольшой, уютный, атмосферный, аутентичный театр. Очень нравится бывать здесь. Как-то по-домашнему, тепло и комфортно.',
            'rating' => 5,
            'created_at' => '2024-09-09 13:13:00',
            'updated_at' => '2024-09-09 13:13:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 13,
            'text' => 'Здание очень среднее... На представление попасть не довелось, а снаружи даже желания зайти не возникло, хотя бывает театр так и манит...',
            'rating' => 4,
            'created_at' => '2024-10-12 20:24:52',
            'updated_at' => '2024-10-12 20:24:52',
        ]);

        Review::insert([
            'user_id' => 4,
            'place_id' => 13,
            'text' => 'Челябинский академический театр им. Н.Орлова является крупнейшим театром Южного Урала, гордостью нашего края, культурным центром Челябинска и области, работу которого обеспечивают признанные мастера сценического искусства. Творческий и технический состав театра в течение трех десятилетий любовно, по крупицам, собирал его художественный руководитель народный артист России Наум Юрьевич Орлов, чье имя теперь носит театр. Cезон 2010-2011 г.г. стал для театра юбилейным, а в декабре 2011 года театр отпраздновал 90-летие.',
            'rating' => 4,
            'created_at' => '2024-11-15 18:14:43',
            'updated_at' => '2024-11-15 18:14:43',
        ]);

        //Челябинский Зоопарк
        Review::insert([
            'user_id' => 2,
            'place_id' => 14,
            'text' => 'Пожалуйста, сделайте что-то с территорией для туканов! Туканы свободолюбивые птицы, но у них невероятно мало места, это издевательство 🥺',
            'rating' => 2,
            'created_at' => '2024-09-09 13:13:00',
            'updated_at' => '2024-09-09 13:13:00',
        ]);

        Review::insert([
            'user_id' => 3,
            'place_id' => 14,
            'text' => 'Зоопарк,как зоопарк. Небольшой, и, как мне кажется, по сравнению с годами ранее, становится все пустее и пустее. Он всегда был не особо взрачным, серым. Были и пустые вольеры. Имеющиеся животные в зоопарке выглядят хорошо: ухоженные, с нормальной упитанностью, однако, вольеры оставляют желать лучшего. В целом и прочем, для посещения с детьми на пару раз сойдет, но по сравнению с зоопарками других городов - серо и пусто.',
            'rating' => 3,
            'created_at' => '2024-10-13 14:15:00',
            'updated_at' => '2024-10-13 14:15:00',
        ]);

        //Центральный Стадион
        Review::insert([
            'user_id' => 4,
            'place_id' => 15,
            'text' => 'На матчах бывал неоднократно - и на второй лиге, и на Кубке России + на хоккейной \"Русской классике\" Город у нас не самый футбольный, арена (хоть и вполне вместительная) в не самом хорошем состоянии. Надеюсь, что когда-нибудь эта ситуация изменится!',
            'rating' => 4,
            'created_at' => '2024-12-01 16:17:34',
            'updated_at' => '2024-12-01 16:17:34',
        ]);
    }
}
