@extends('welcome')
@section('title', 'Политика конфиденциальности')
@section('content')
    <div class="container">
        <div class="row">
            <div class="col"></div>
            <div class="col-8 col-md-8" style="text-align: justify;">
                <h2 class="text-center">Политика конфиденциальности</h2>
                <p>Данная <strong>Политика конфиденциальности</strong> определяет, как сайт-гид по туристическим местам г. Челябинска
                    (далее – «Сайт») собирает, использует, хранит и защищает данные пользователей. Используя Сайт, вы
                    соглашаетесь с условиями данной Политики конфиденциальности.</p>
                <ul>
                    <strong>1. Сбор и использование информации</strong>
                    <li>1.1. Сайт собирает минимальные данные для обеспечения качественного сервиса, такие как данные для регистрации, обратной связи и анализа посещаемости.</li>
                    <li>1.2. Личные данные, такие как имя, контактная информация, предоставляются пользователем добровольно.</li>
                </ul>

                <ul>
                    <strong>2. Цели сбора данных</strong>
                    <li>2.1. Сайт использует данные для улучшения качества обслуживания, аналитики, обратной связи с пользователями и предоставления информации о новых функциях и обновлениях.</li>
                </ul>

                <ul>
                    <strong>3. Хранение и защита данных</strong>
                    <li>3.1. Сайт принимает необходимые меры для защиты личных данных пользователей от несанкционированного доступа, изменения или уничтожения.</li>
                    <li>3.2. Доступ к личным данным ограничен, и такие данные обрабатываются в соответствии с действующим законодательством.</li>
                </ul>

                <ul>
                    <strong>4. Передача данных третьим лицам</strong>
                    <li>4.1. Сайт обязуется не передавать личные данные третьим лицам, за исключением случаев, предусмотренных законом.</li>
                    <li>4.2. Данные могут передаваться в случаях, если это требуется для предоставления услуг, соблюдения требований законодательства или с согласия пользователя.</li>
                </ul>

                <ul>
                    <strong>5. Изменения в Политике конфиденциальности</strong>
                    <li>5.1. Сайт оставляет за собой право вносить изменения в Политику конфиденциальности. Обновления публикуются на данной странице.</li>
                    <li>5.2. Рекомендуем периодически проверять Политику для ознакомления с актуальными изменениями.</li>
                </ul>

                <ul>
                    <strong>6. Контакты</strong>
                    <li>6.1. По любым вопросам, связанным с Политикой конфиденциальности, пожалуйста, свяжитесь с администрацией Сайта через раздел «Контактная информация» внизу сайта.</li>
                </ul>
            </div>
            <div class="col"></div>
        </div>
    </div>
@endsection
