@extends('welcome')
@section('title', 'Советы путешественникам')
@section('content')
    <div class="container">
        <div class="row">
            <h1 class="text-center">Советы путешественникам</h1>
            <div class="col"></div>
            <div class="col-10 col-md-6">
                <p style="text-align: justify;">Данные советы помогут вам как туристам и путешественникам подготовиться к поездке и насладиться всеми преимуществами, которые может предложить Челябинск.</p>
            </div>
            <div class="col"></div>
        </div>
        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo1.png') }}" alt="Фото совета путешественникам">
                <h3>Определите свои интересы и составьте план</h3>
                <p style="text-align: justify;">Перед поездкой определите, что именно вам интересно: музеи, архитектура, природные достопримечательности или городские развлечения. Наш сайт-гида поможет вам составить удобный маршрут по туристическим местам Челябинска, учитывая ваши предпочтения.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo2.png') }}" alt="Фото совета путешественникам">
                <h3>Уточните прогноз погоды</h3>
                <p style="text-align: justify;">Погода в Челябинске может меняться довольно быстро, особенно в межсезонье. Уточняйте прогноз на каждый день и одевайтесь по погоде, чтобы поездка прошла комфортно. Если планируете активные прогулки, лучше захватить дождевик или зонтик.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo3.png') }}" alt="Фото совета путешественникам">
                <h3>Используйте общественный транспорт и такси</h3>
                <p style="text-align: justify;">Челябинск хорошо оборудован сетью общественного транспорта. Автобусы, трамваи и маршрутные такси помогут быстро и экономично добраться до большинства туристических точек. Местные приложения для такси также доступны и удобны.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo4.png') }}" alt="Фото совета путешественникам">
                <h3>Обратите внимание на местные традиции и историю</h3>
                <p style="text-align: justify;">Челябинск — это не только промышленный центр Урала, но и город с богатой историей и культурой. Чтобы получить максимум впечатлений от поездки, стоит подготовиться к ней заранее и узнать больше о местных традициях и обычаях. вы можете прогуляться по историческому центру города, посетить музеи и театры, отправиться на экскурсию по заводским территориям или насладиться красотой уральской природы.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo5.png') }}" alt="Фото совета путешественникам">
                <h3>Запаситесь наличными деньгами</h3>
                <p style="text-align: justify;">Хотя в Челябинске большинство заведений принимают карты, в некоторых небольших кафе и магазинах в туристических районах может быть удобнее расплатиться наличными.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo6.png') }}" alt="Фото совета путешественникам">
                <h3>Учитывайте разницу во времени</h3>
                <p style="text-align: justify;">Если вы путешествуете из другого часового пояса, помните, что в Челябинске время может значительно отличаться. Учтите это при планировании поездки и осмотре достопримечательностей.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo7.png') }}" alt="Фото совета путешественникам">
                <h3>Внимание к безопасности и уважению к окружающим</h3>
                <p style="text-align: justify;">Как и в любом городе, будьте внимательны к своим вещам и следите за безопасностью. Челябинцы — дружелюбные и гостеприимные люди, поэтому не стесняйтесь обращаться к местным жителям за помощью или рекомендациями.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo8.png') }}" alt="Фото совета путешественникам">
                <h3>Изучите несколько фраз на русском (если вы иностранец)</h3>
                <p style="text-align: justify;">В Челябинске не все жители владеют английским языком, поэтому знание базовых фраз на русском может оказаться полезным. Простые фразы, такие как «Здравствуйте», «Спасибо» и «Помогите», будут полезны.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo9.png') }}" alt="Фото совета путешественникам">
                <h3>Запаситесь сувенирами и поддержите местные ремесла</h3>
                <p style="text-align: justify;">Челябинск славится уникальными ремеслами, изделиями из камня, фарфора и многим другим. Посетите сувенирные лавки и поддержите местных мастеров, купив что-то памятное о своем путешествии.</p>
            </div>
        </div>

        <div class="row mt-3">
            <div class="d-flex flex-column m-auto" style="max-width: 760px;">
                <img src="{{ asset('images/TravelTips/photo10.png') }}" alt="Фото совета путешественникам">
                <h3>Уточните график работы туристических объектов</h3>
                <p style="text-align: justify;">Некоторые музеи и достопримечательности Челябинска могут работать по сокращенному графику в выходные или праздничные дни. Перед посещением обязательно уточните режим работы, чтобы избежать разочарований.</p>
            </div>
        </div>
    </div>
@endsection
