@extends('welcome')
@section('title', 'Пользовательское соглашение')
@section('content')
    <div class="container">
        <div class="row">
            <div class="col"></div>
            <div class="col-8"  style="text-align: justify;">
                <h1 class="text-center">Пользовательское соглашение</h1>
                <p>Добро пожаловать на сайт-гид по туристическим местам г. Челябинска (далее – «Сайт»).
                    Настоящее <strong>Пользовательское соглашение</strong> (далее – «Соглашение») регулирует отношения между
                    администрацией Сайта и пользователями (далее – «Пользователи»). Внимательно ознакомьтесь с условиями
                    Соглашения перед использованием Сайта.</p>
                <ul>
                    <strong>1. Термины и соглашения</strong>
                    <li>1.1. «Сайт» – интернет-ресурс, предоставляющий информацию о туристических местах Челябинска.</li>
                    <li>1.2. «Пользователь» – любое лицо, посетившее Сайт и использующее его материалы.</li>
                    <li>1.3. «Контент» – тексты, изображения, видео, доступные на Сайте.</li>
                </ul>

                <ul>
                    <strong>2. Общие условия использования</strong>
                    <li>2.1. Использование материалов Сайта допускается только в некоммерческих целях.</li>
                    <li>2.2. Любое копирование материалов возможно только с письменного разрешения администрации.</li>
                    <li>2.3. Пользователь обязуется не нарушать права третьих лиц при использовании Сайта.</li>
                </ul>

                <ul>
                    <strong>3. Права и обязанности сторон</strong>
                    <li>3.1. Администрация предоставляет пользователям доступ к информации на Сайте.</li>
                    <li>3.2. Пользователь обязуется соблюдать требования данного Соглашения и действующее законодательство РФ.</li>
                    <li>3.3. Администрация оставляет за собой право изменять материалы на Сайте, а также данное Соглашение.</li>
                </ul>

                <ul>
                    <strong>4. Ограничение ответственности</strong>
                    <li>4.1. Администрация предоставляет пользователям доступ к информации на Сайте.</li>
                    <li>4.2. Администрация не несет ответственности за любые убытки, связанные с использованием или невозможностью использования Сайта.</li>
                    <li>4.3. Сайт предоставляет информацию «как есть», и администрация не гарантирует точности и полноты информации.</li>
                </ul>

                <ul>
                    <strong>5. Заключительные положения</strong>
                    <li>5.1. Данное Соглашение вступает в силу с момента использования Сайта.</li>
                    <li>5.2. Вопросы, не урегулированные настоящим Соглашением, регулируются законодательством РФ.</li>
                </ul>
            </div>
            <div class="col"></div>
        </div>
    </div>
@endsection
