@extends('welcome')
@section('title', 'Культура Челябинска')
@section('content')
    <div class="container">
        <div class="row mb-3">
            <div class="col-12 col-md-10 m-auto">
                <img src="{{ asset('images/MainSlider/photo3.png') }}" style="border-radius: 30px;" class="d-block w-100" alt="Превью статьи">
            </div>
        </div>
        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h1 class="text-center">Культура Челябинска: богатое наследие и ключевые культурные места</h1>
                <p style="text-align: justify;">Челябинск – это не только индустриальный центр, но и город с богатой культурной жизнью. Здесь гармонично сочетаются историческое наследие, современные достижения искусства и многообразие культур.</p>
                <p style="text-align: justify;">Жители и гости города могут насладиться театральными постановками, увлекательными музейными экспозициями, отдыхом в парках и уникальными этнокультурными мероприятиями.</p>
            </div>
            <div class="col"></div>
        </div>

        {{-- Раздел для театров --}}
        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <div class="mt-3">
                    <h3 class="text-center">Театры – душа Челябинска</h3>
                    <p style="text-align: justify;">Челябинск заслуженно называют театральной столицей Южного Урала. В городе действуют 16 театров, каждый из которых по-своему уникален:</p>
                </div>
                <div class="d-flex flex-column mt-3"  style="max-width: 760px;">
                    <h3>Челябинский академический театр драмы имени Наума Орлова</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo1.png') }}" alt="Челябинский академический театр драмы имени Наума Орлова">
                    <span class="text-center"><strong>Местоположение:</strong> Площадь Революции, д.6</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 09:30 до 19:00, обед с 14:00 до 15:00.</span>
                    <p class="mt-3" style="text-align: justify;">Театр обладает двумя сценическими площадками: большой зал на 850 мест и малая сцена на 102 посадочных места. Одновременно театр способен вместить до 1000 зрителей.</p>
                    <p style="text-align: justify;">Ежегодно театр выпускает до 10 премьерных спектаклей. С ним сотрудничают режиссёры и художники-сценографы из Москвы, Санкт-Петербурга и других городов России.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Театр оперы и балета имени М. И. Глинки</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo2.png') }}" alt="Театр оперы и балета имени М. И. Глинки">
                    <span class="text-center"><strong>Местоположение:</strong> Площадь Искусств, 1</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 10:00 до 20:00, перерыв с 14:00 до 14:30.</span>
                    <p class="mt-3" style="text-align: justify;">Театр оперы и балета имени М. И. Глинки – настоящий оплот музыкального искусства. Репертуар театра включает классические оперы, балеты и современные постановки.</p>
                    <p style="text-align: justify;">За свою историю труппа театра гастролировала более чем в 70 городах и завоевала международное признание.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Государственный театр кукол</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo3.png') }}" alt="Государственный театр кукол">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Кирова, д.8</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 09:00 до 19:00. Перерыв с 12:00 до 12:45</span>
                    <p class="mt-3" style="text-align: justify;">Государственный театр кукол, один из старейших на Урале, известен своей уникальной техникой кукловождения. В 2012 году театр получил национальную премию «Золотая маска» за постановку «Удивительное путешествие кролика Эдварда».</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Молодежный драматический театр</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo4.png') }}" alt="Молодежный драматический театр">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Кирова, д.116</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 9:00 до 20:30, перерыв с 14:00 до 14:30.</span>
                    <p class="mt-3" style="text-align: justify;">Молодежный драматический театр активно работает с современной драматургией, привлекая молодую аудиторию. Он славится многими факторами:</p>
                    <ul>
                        <li><strong>Спецпроекты.</strong> Презентации лучших современных пьес, драматургические марафоны, творческие встречи, лекции, экскурсии, перформансы.</li>
                        <li><strong>Фестиваль</strong> современного искусства PULSE. Театр выступает площадкой фестиваля с 2019 года.</li>
                        <li><strong>Проект «Театр и мир».</strong> Воспитание чувства гордости и любви к малой родине у подрастающего поколения через деятельность театра и новые формы взаимодействия со зрителями.</li>
                    </ul>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Челябинский государственный драматический Камерный театр</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo5.png') }}" alt="Челябинский государственный драматический Камерный театр">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Цвиллинга, 15</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 14:00 до 21:00.</span>
                    <p class="mt-3" style="text-align: justify;">Челябинский государственный драматический Камерный театр — это известный культурный центр города, который привлекает зрителей разнообразными постановками.</p>
                    <p style="text-align: justify;">Театр славится высоким уровнем мастерства актёров и интересными режиссёрскими решениями, которые помогают воплотить на сцене яркие и запоминающиеся спектакли. Люди ходят в Камерный театр, чтобы насладиться высоким искусством и получить незабываемые впечатления.</p>
                </div>

                <p class="mt-3 text-center">Театральная жизнь Челябинска наполнена фестивалями, такими как «Камерата» и «Театральные опыты», которые объединяют любителей искусства со всей страны.</p>
            </div>
            <div class="col"></div>
        </div>

        {{--    Раздел для музеев    --}}
        <div class="row mt-5">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <div class="mt-3">
                    <h3 class="text-center">Музеи – сокровищницы знаний</h3>
                    <p style="text-align: justify;">Музейная сеть Челябинска включает как крупные государственные учреждения, так и уникальные частные музеи:</p>
                </div>
                <div class="d-flex flex-column mt-3"  style="max-width: 760px;">
                    <h3>Государственный исторический музей Южного Урала</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo6.png') }}" alt="Государственный исторический музей Южного Урала">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Труда, д.100</span>
                    <span class="text-center"><strong>Время работы:</strong> пн–пт: с 10:00 до 19:00; сб–вс: с 11:00 до 19:00, касса закрывается на час раньше.</span>
                    <p class="mt-3" style="text-align: justify;">Государственный исторический музей Южного Урала. Его экспозиция рассказывает об истории края с древних времен. Музей расположен на месте бывшей Челябинской крепости, а его архитектура напоминает крепостные стены.</p>
                    <p style="text-align: justify;">Главным экспонатом музея является тот самый Челябинский метеорит, который упал 15 февраля 2013, посетителям разрешают каждый год 15 февраля прикоснуться к экспонату.</p>
                    <p style="text-align: justify;">В музее на крыше размещены старинные фотографии города. Если кто до похода в музей успел погулять по городу, сможет сравнить виды с фотографий с современными улицами и домами.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Челябинский музей изобразительных искусств</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo7.png') }}" alt="Челябинский музей изобразительных искусств">
                    <span class="text-center"><strong>Местоположение:</strong>пл. Революции, 1</span>
                    <span class="text-center"><strong>Время работы:</strong> вторник, среда, суббота и воскресенье с 10:00 до 18:00, касса до 17:30; четверг с 12:00 до 20:00, касса до 19:30; пятница с 10:00 до 20:00, касса до 19:30. Понедельник — выходной.</span>
                    <p class="mt-3" style="text-align: justify;">Челябинский музей изобразительных искусств объединяет коллекции иконописи, скульптуры, графики и декоративно-прикладного искусства. Среди экспонатов – шедевры мастеров Урала и других регионов.</p>
                    <p style="text-align: justify;">В коллекции музея представлены уникальные работы признанных художников мирового уровня. Западноевропейское искусство отмечено произведениями итальянских, французских, немецких, австрийских, испанских художников XVI–XIX веков.</p>
                </div>

                <p class="mt-3 text-center">Музеи Челябинска – это не только история, но и живая культура, в которую может погрузиться каждый посетитель.</p>
            </div>
            <div class="col"></div>
        </div>

        {{--    Раздел для парков и зон отдыха    --}}
        <div class="row mt-5">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <div class="mt-3">
                    <h3 class="text-center">Парки и зоны отдыха</h3>
                    <p style="text-align: justify;">Прогулки по паркам Челябинска – это возможность отдохнуть от городской суеты и насладиться природой:</p>
                </div>
                <div class="d-flex flex-column mt-3"  style="max-width: 760px;">
                    <h3>Парк культуры и отдыха имени Ю. А. Гагарина</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo8.png') }}" alt="Парк культуры и отдыха имени Ю. А. Гагарина">
                    <span class="text-center"><strong>Местоположение:</strong>ул. Коммуны, д.100, стр. 6</span>
                    <span class="text-center"><strong>Время работы:</strong> администрация: с 8:30 до 17:00 (перерыв с 12:00 до 12:30); аттракционы: в понедельник с 12:00 до 22:00, во вторник — воскресенье с 10:00 до 22:00.</span>
                    <p class="mt-3" style="text-align: justify;">Центральный парк культуры и отдыха имени Ю. А. Гагарина – крупнейшая зелёная зона города с аттракционами, зонами отдыха и культурными мероприятиями.</p>
                    <p style="text-align: justify;">Площадь парка — 1200 гектаров, меньше трети территории занимают аттракционы, детские площадки, фонтаны. Остальное — хвойный лес.</p>
                    <p style="text-align: justify;">Зона отдыха включает пешеходные аллеи с цветниками и клумбами, малую Южно-Уральскую железную дорогу, спортивные, игровые, танцевальные площадки, летний театр, аттракционы, детский городок, кафе.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Парк им. А.С. Пушкина</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo9.png') }}" alt="Парк им. А.С. Пушкина">
                    <span class="text-center"><strong>Местоположение:</strong>ул. Орджоникидзе, д.58а</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 07:00 до 23:00–24:00. В зимний период: с понедельника по воскресенье с 7:00 до 23:00.</span>
                    <p class="mt-3" style="text-align: justify;">Парк им. А.С. Пушкина — один из старейших парков культуры и отдыха на Южном Урале. Расположен в центре Челябинска и занимает территорию 20 га. Здесь растут деревья 23 пород, в том числе и редкие на Урале пирамидальные тополя, кедры, серебристые ели.</p>
                    <p style="text-align: justify;">Ежегодно сооружается снежный городок. Парк проводит фестивали, театрализованные представления, выставки-продажи, ярмарки, народные гулянья. Уникальная зеленая среда парка — отличное место для проведения выставок живописи, изделий народных промыслов, цветов и т.п. Летом проходят концерты для любителей духовой музыки, молодежные дискотеки, театрализованные балы для детей, показательные выступления мастеров бального танца, встречи с писателями, артистами, модельерами и другое.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Челябинский зоопарк</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo10.png') }}" alt="Челябинский зоопарк">
                    <span class="text-center"><strong>Местоположение:</strong>ул. Труда, д.191</span>
                    <span class="text-center"><strong>Время работы:</strong> В летнее время: с 10:00 до 20:00 (касса работает до 19:00). В зимнее время: с 10:00 до 18:00 (касса работает до 17:00). Каждый последний понедельник месяца — санитарный день, зоопарк закрыт.</span>
                    <p class="mt-3" style="text-align: justify;">Челябинский зоопарк – дом для более чем 130 видов животных, включая редкие виды, занесенные в Красную книгу.</p>
                    <p style="text-align: justify;">В коллекции есть львы, амурские тигры, белые и бурые медведи, леопарды, шимпанзе, зебры, верблюды, ламы, мангусты, экзотические рыбы в аквариумах.</p>
                    <p style="text-align: justify;">На территории зоопарка есть детский контактный зоопарк с одомашненными животными, где всех можно погладить.</p>
                    <p style="text-align: justify;">В зоопарке регулярно проводятся экскурсионные и образовательные программы, экологические акции, выставки и праздничные мероприятия.</p>
                </div>

                <p class="mt-3 text-center">Эти места делают Челябинск не только культурным, но и экологически привлекательным городом.</p>
            </div>
            <div class="col"></div>
        </div>

        {{--    Раздел для национально-культурных центров и мостов дружбы    --}}
        <div class="row mt-5">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <div class="d-flex flex-column mt-3"  style="max-width: 760px;">
                    <h3>Национально-культурные центры – мосты дружбы</h3>
                    <img src="{{ asset('images/CultureOfTheCity/photo11.png') }}" alt="Парк культуры и отдыха имени Ю. А. Гагарина">
                    <span class="text-center">На данном фото изображён <strong>Центр народного единства</strong>.</span>
                    <span class="text-center"><strong>Местоположение:</strong>ул. Салютная, д.22</span>
                    <span class="text-center"><strong>Время работы:</strong> В летнее время: с 10:00 до 20:00 (касса работает до 19:00). В зимнее время: с 10:00 до 18:00 (касса работает до 17:00). Каждый последний понедельник месяца — санитарный день, зоопарк закрыт.</span>
                    <p class="mt-3" style="text-align: justify;">Многонациональный состав Челябинской области способствует развитию этнокультурных центров. Здесь действуют более 30 национальных организаций, включая татарские, башкирские, армянские, корейские и немецкие центры. Эти объединения проводят фестивали, творческие вечера и образовательные программы, которые знакомят жителей с многообразием культурных традиций.</p>
                </div>
            </div>
            <div class="col"></div>
        </div>

        {{--    Раздел для вывода    --}}
        <div class="row mt-5">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <div class="d-flex flex-column mt-3"  style="max-width: 760px;">
                    <h3>Вывод</h3>
                    <p class="mt-3" style="text-align: justify;">Челябинск – это город, где прошлое переплетается с настоящим, а культурное многообразие создаёт неповторимую атмосферу. Театры, музеи, парки и этнокультурные мероприятия делают его значимым центром искусства и истории не только Южного Урала, но и всей России. Независимо от интересов, каждый найдёт в Челябинске что-то по душе, обогащая своё восприятие мира.</p>
                </div>
            </div>
            <div class="col"></div>
        </div>

    </div>
@endsection
