@extends('welcome')
@section('title', 'Челябинск в разные времена года')
@section('content')
    <div class="container">
        <div class="row mb-3">
            <div class="col-12 col-md-10 m-auto">
                <img src="{{ asset('images/MainSlider/photo1.png') }}" style="border-radius: 30px;" class="d-block w-100" alt="Превью статьи">
            </div>
        </div>
        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h1 class="text-center">Челябинск в разные времена года</h1>
                <p style="text-align: justify;">В Челябинске очень много красивых и популярных мест, которые могут вам понравиться своей уникальностью и историей, а также тем, что они выглядят по-особенному в определенное время года.</p>
                <p style="text-align: justify;">В этой статье мы собрали одни из самых красивых мест, которые не только могут вас заинтересовать,  но и почувствовать огромный восторг от их посещения.</p>
            </div>
            <div class="col"></div>
        </div>
        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h2 class="text-center">Весна</h2>
                <div class="d-flex flex-column "  style="max-width: 760px;">
                    <h3>Ботанический сад Челябинского государственного университета</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo1.png') }}" alt="Ботанический сад Челябинского государственного университета">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Братьев Кашириных, д. 129</span>
                    <span class="text-center"><strong>Время работы:</strong> пн-сб: 8:00-21:00, вс-выходной</span>
                    <p class="mt-3" style="text-align: justify;">Если и начать свое путешествие по Челябинску, то определенно с этого места. Именно в весну ботанический сад преображается: цветут разнообразные растения, а воздух наполняется ароматами.</p>
                    <p style="text-align: justify;">Это отличное место для прогулок и отдыха на природе, где можно насладиться красотой цветов и растений, а также увидеть сусликов, которые живут в норах на территории сада.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Набережная реки Миасс</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo2.png') }}" alt="Набережная реки Миасс">
                    <span class="text-center"><strong>Местоположение:</strong> Набережная реки Миасс от ул.Кирова до ул. Пушкина</span>
                    <span class="text-center"><strong>Время работы:</strong> круглосуточно</span>
                    <p class="mt-3" style="text-align: justify;">Набережная реки Миасс — это не только живописное место, но и центр культурной жизни города. Здесь проводятся фестивали, концерты, выставки и другие мероприятия, которые привлекают жителей и гостей Челябинска.</p>
                    <p style="text-align: justify;">Весной на набережной можно насладиться красотой природы и одновременно окунуться в атмосферу городской жизни.</p>
                </div>
            </div>
            <div class="col"></div>
        </div>

        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h2 class="text-center">Лето</h2>
                <div class="d-flex flex-column "  style="max-width: 760px;">
                    <h3>Алое поле</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo3.png') }}" alt="Алое поле">
                    <span class="text-center"><strong>Местоположение:</strong> Сквер Алое Поле</span>
                    <span class="text-center"><strong>Время работы:</strong> круглосуточно</span>
                    <p class="mt-3" style="text-align: justify;">Это одно из самых популярных мест в Челябинске, где проводятся различные фестивали, концерты и другие мероприятия. Здесь можно прогуляться по красивым аллеям и посетить памятники архитектуры.</p>
                    <p style="text-align: justify;">Здесь проходили первые революционные митинги и собрания, а в советское время площадь стала местом проведения массовых мероприятий и праздников. Сегодня Алое поле продолжает оставаться важным культурным и историческим центром города.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Сад камней</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo4.png') }}" alt="Сад камней">
                    <span class="text-center"><strong>Местоположение:</strong> Челябинск, сад Камней</span>
                    <span class="text-center"><strong>Время работы:</strong> круглосуточно</span>
                    <p class="mt-3" style="text-align: justify;">Это уникальное место, где собраны камни из разных уголков мира. Здесь можно сделать красивые фотографии, отдохнуть на скамейках и насладиться тишиной и спокойствием.</p>
                    <p style="text-align: justify;">В летнее время Сад камней становится  ещё более привлекательным благодаря зелени и цветам, которые украшают пространство. Здесь можно отдохнуть от городской суеты и насладиться красотой природы.</p>
                </div>
            </div>
            <div class="col"></div>
        </div>

        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h2 class="text-center">Осень</h2>
                <div class="d-flex flex-column "  style="max-width: 760px;">
                    <h3>Свято-Симеоновский кафедральный собор</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo5.png') }}" alt="Свято-Симеоновский кафедральный собор">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Кыштымская, д.32</span>
                    <span class="text-center"><strong>Время работы:</strong> Ежедневно с 08:00 до 19:00</span>
                    <p class="mt-3" style="text-align: justify;">Это один из самых красивых соборов в Челябинске. Здесь можно насладиться спокойной атмосферой и красивыми видами.</p>
                    <p style="text-align: justify;">Осенью собор особенно красив: яркие краски листвы на фоне белых стен создают неповторимую атмосферу. Здесь можно насладиться спокойной и умиротворённой обстановкой, а также послушать церковное пение или принять участие в богослужении.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Озеро Смолино</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo6.png') }}" alt="Озеро Смолино">
                    <span class="text-center"><strong>Местоположение:</strong> Озеро Смолино</span>
                    <span class="text-center"><strong>Время работы:</strong> ежедневно с 09:00 до 21:00</span>
                    <p class="mt-3" style="text-align: justify;">Это большое озеро, расположенное недалеко от Челябинска, привлекает туристов своей красотой и возможностью отдохнуть на природе.</p>
                    <p style="text-align: justify;">Озеро Смолино привлекает туристов красотой в любое время года, но осенью здесь особенно красиво. Деревья окрашиваются в яркие цвета, создавая живописный фон для прогулок и фотосессий.</p>
                    <p style="text-align: justify;">Отдых на природе осенью может быть особенно приятным: свежий прохладный воздух, красивые осенние пейзажи и отсутствие большого количества туристов — всё это может сделать отдых на озере Смолино запоминающимся.</p>
                </div>
            </div>
            <div class="col"></div>
        </div>

        <div class="row">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h2 class="text-center">Зима</h2>
                <div class="d-flex flex-column "  style="max-width: 760px;">
                    <h3>Кировка</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo7.png') }}" alt="Кировка">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Кирова, д.159</span>
                    <span class="text-center"><strong>Время работы:</strong> круглосуточно</span>
                    <p class="mt-3" style="text-align: justify;">Это просто идеальное место для фотографов, поскольку в этом месте вся пешеходная улица стала площадкой для фотосессий. К световому потолку в декабре каждый год добавляют новогодние арт-объекты: шары, деревья, гирлянды и многое другое, что делает это место в зимний период ещё ярче и красочнее.</p>
                    <p style="text-align: justify;">Однако есть одна проблема. Если вы хотите сфотографироваться в одиночестве, лучше приехать на Кировку рано утром, часов в 5-6. В другое время здесь будет много туристов и местных жителей, особенно в новогодние праздники.</p>
                </div>

                <div class="d-flex flex-column mt-5"  style="max-width: 760px;">
                    <h3>Парк Гагарина</h3>
                    <img src="{{ asset('images/DifferentSeasons/photo8.png') }}" alt="Парк Гагарина">
                    <span class="text-center"><strong>Местоположение:</strong> ул. Коммуны, д.100, стр. 6.</span>
                    <span class="text-center"><strong>Время работы:</strong> пн–пт: 11:00–21:00, сб–вс: 10:00–22:00.</span>
                    <p class="mt-3" style="text-align: justify;">В парке Гагарина есть множество интересных мест: здесь можно покататься на аттракционах, пройти через световой туннель, полюбоваться ротондой, пересечь мост над прудом и насладиться видом заснеженных сосен.</p>
                    <p style="text-align: justify;">Лучше всего посетить парк ближе к вечеру, особенно в будний день. В это время включается подсветка, и народу становится меньше.</p>
                    <p style="text-align: justify;">Если вы идёте через городской бор в сторону улицы Худякова, то можете пройти через туннель. Вокруг вас будут заснеженные сосны, а над головой — гирлянда.</p>
                </div>
            </div>
            <div class="col"></div>
        </div>
        <div class="row mt-3">
            <div class="col"></div>
            <div class="col-10 col-md-8">
                <h3>Заключение</h3>
                <p style="text-align: justify;">В данной статье были представлены лишь некоторые из множества интересных мест, которые можно посетить в Челябинске. Город предлагает разнообразные возможности для отдыха и развлечений, подходящие для туристов с разными интересами, поэтому если вы не нашли для себя то самое место, которое бы вас заинтересовало, то рекомендуем ознакомиться с нашим каталогом туристических мест, в котором мы собрали наиболее подходящие места для всех туристов.</p>
            </div>
            <div class="col"></div>
        </div>
    </div>
@endsection
